# MajorSpacing Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricSheetType..::..MajorSpacing Property
FabricSheetType Class See Also
---
The spacing between the wires in the major direction (not including the overhangs).
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double MajorSpacing { get; }
```

Visual Basic
---
```text
Public ReadOnly Property MajorSpacing As Double
	Get
```

Visual C++
---
```text
public:
property double MajorSpacing {
	double get ();
}
```

# See Also
FabricSheetType Class
Autodesk.Revit.DB.Structure Namespace